app/views/epicenter/show_user.html.erb

SELECT "tweets".* FROM "tweets"  WHERE "tweets"."user_id" = ?  ORDER BY "tweets"."updated_at" ASC  [["user_id", 1]]
SELECT COUNT(*) FROM "tweets"  WHERE "tweets"."user_id" = ?  [["user_id", 4]]
---
          <label>Woofs:</label>
          <span class="badge"><%= @user.tweets.count %></span>

SELECT "users".* FROM "users"
---
     <% if !@user.followers.empty? %>
       <h3><%= @user.followers.count %> pups follow <%= @user.username %>:</h3>