app/controllers/epicenter_controller.rb

SELECT "users".* FROM "users"
---
  def feed
  	# Here we initialize the array that will
  	# hold tweets from the current_user's
  	# following list.
  	@tweets_for_feed = []
    @users = User.all