app/controllers/epicenter_controller.rb

SELECT "users".* FROM "users"
---
  def now_following
  	# This line is just for displaying purposes:
  	@user = User.find(params[:follow_id])
    @users = User.all