app/controllers/epicenter_controller.rb

SELECT "tweets".* FROM "tweets"   ORDER BY "tweets"."updated_at" ASC
SELECT  "tweets".* FROM "tweets"   ORDER BY updated_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "tweets"
SELECT "tweets".* FROM "tweets"
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
---
  def feed
  	# Here we initialize the array that will
  	# hold tweets from the current_user's
  	# following list.
  	@tweets_for_feed = []

  	# We pull in all the tweets...
  	@tweetz = Tweet.all.order(:updated_at).reverse
    @tweets = Tweet.paginate(:page => params[:page], :per_page => 5).order('updated_at DESC')
  	# Then we sort through the tweets
  	# to find the ones associated with
  	# users from the current_user's
  	# following array.
  	@tweetz.each do |tweet|
  		current_user.following.each do |f|
  			if tweet.user_id == f
  				@tweets_for_feed.push(tweet)
  				# And those tweets are pushed
  				# into the @following_tweets array
  				# we saw back in the view.
  			end
  		end
  	end
    show_followers

    @user = User.find(current_user.following.last)

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
SELECT "users".* FROM "users"
INSERT INTO "tweets" ("created_at", "message", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-21 17:03:55.256622"], ["message", "Beautiful Friday here in the ATL"], ["updated_at", "2014-11-21 17:03:55.256622"], ["user_id", 1]]
SELECT  "tweets".* FROM "tweets"  WHERE "tweets"."user_id" = ?  ORDER BY updated_at DESC LIMIT 5 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "tweets"  WHERE "tweets"."user_id" = ?  [["user_id", 1]]
---
  def show_user
  	@user = User.find(params[:user_id])
    @users = User.all

    tweet = Tweet.new
    tweet.message = params[:message]
    tweet.user_id = params[:user_id]
    tweet.save
    show_followers

    # Show a user's tweets
    @user_tweets = @user.tweets.paginate(:page => params[:page], :per_page => 5).order('updated_at DESC')

SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "following" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["following", "---\n- 1\n"], ["updated_at", "2014-11-21 17:14:31.659252"]]
---
  def now_following
  	# This line is just for displaying purposes:
  	@user = User.find(params[:follow_id])
  	# Here is where some back-end
  	# work really happens:
  	current_user.following.push(params[:follow_id].to_i)

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "following" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["following", "--- []\n"], ["updated_at", "2014-11-22 23:01:24.552401"]]
---
  def unfollow
    @user = User.find(params[:follow_id])
    current_user.following.delete(params[:follow_id].to_i)
    current_user.save