app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.paginate(:page => params[:page], :per_page => 5).order('updated_at DESC')
    #@tweets = @tweets.order(:updated_at).reverse
    @users = User.all
---
SELECT  "tweets".* FROM "tweets"   ORDER BY "tweets"."updated_at" ASC LIMIT 30 OFFSET 30
SELECT COUNT(*) FROM "tweets"
SELECT "users".* FROM "users"

  def edit
    @users = User.all
---
SELECT "users".* FROM "users"

  def update
    @tweet.update(tweet_params)
---
UPDATE "tweets" SET "message" = ?, "updated_at" = ? WHERE "tweets"."id" = 6  [["message", "Fell asleep while nibbling on my old blanket! Fell asleep while nibbling on my old blanket!"], ["updated_at", "2014-11-21 23:17:40.864399"]]